# num = 1
# условие
# if(num == 1):
#     print("ok if")

# print("end")
# bool
# print(num == 1)


# # True - истина 
# # False - лож 


# Логические операторы:

# ровно
# print("2 == 2  =" , 2 == 2)

# неровно
# print("3 != 2  =" , 3 != 2)

# меньше
# print("4 < 2  =" , 4 < 2)

# больше
# print("4 > 2  =" , 4 > 2)

# меньше и ровно
# print("4 <= 2  =" , 4 <= 2)

# больше и ровно
# print("4 >= 2  =" , 4 >= 2)


# различие между меньше , меньше и ровно
# print("2 < 2  =" , 2 < 2)
# print("2 <= 2  =" , 2 <= 2)


# пример условия 
# if(num != 1):
#     print("ok if 22")
#     print("ok if 22")
#     print("ok if 22")
#     print("ok if 22")
#     print("ok if 22")




# иначе
# num_2 = 5
# if(num_2 < 3):
#     print("ok if")
# else:
#     print("not else")



# if принимает bool
# if(True):
#     print("if(True)")



# and - возвращает true , если оба true
# num_bool = True
if(False and True):
    print("if(True)")
print(True and True)

    



# дз
# Задание 1. Пользователь вводит число. Определить, является ли оно четным.

# Задание 2. Пользователь вводит два числа. Вывести на 
# экран меньшее из этих чисел. 

# Задание 3. Пользователь вводит число. Определить, положительное это число, отрицательное или равно нулю.

# Задание 4. Пользователь вводит два числа. Определить, 
# равны ли эти числа, и если нет, вывести их на экран в порядке возрастания