# создание и вывод переменной
# num = 5
# print(num)
# num = 6 + num
# print(num)
# print(2, 4, 8)


# типы данных
# print("int = " , 4) # int - Целые числа
# print("float = " , 3.0) # float - Числа с плавающей точкой
# print("bool = " , True,False) # boot - Логические значения
# print("str = " , 'hello',"5") # str - Строка
# print("None = ") # null - Ничего


# арифметические операторы
# print("2 + 2 =", 2 + 2) #Сумма
# print("2 - 2 =",2 - 2) #Вычитание
# print("2 * 2 =",2 * 3) #Умножение
# print("2 ** 2 =",2 ** 3) #Возведение в степень
# print("10 / 3 =",10 / 3) #Деление
# print("10 // 3 =",10 // 3) #деление без остатка 
# print("10 % 3 =",10 % 3) #остаток от деления


# использование скобо
# num_2 = 4 * (2 + 3)
# print(num_2)



# пример названия переменных
# int_num = 8
# print(int_num)

# intNum = 8
# print(intNum)

# qw4er = 8
# print(qw4er)




# вывод тип переменной
# num_3 = 7
# print(type(num_3))
# num_3 = "7"
# print(type(num_3))

# print("type int = " , type(4))
# print("type float = " , type(3.0))
# print("type bool = " , type(True))
# print("type str = " , type('hello'))



# умножение строки
# str_int = "5"
# print(str_int * 3)
# print(type(str_int))
# print("---------------")
# преобразование строки в число 
# str_int = int(str_int)
# умножение числа
# print(str_int * 3)
# print(type(str_int))


# преобразование float в int
# num_flo_int = 7.9
# print(int(num_flo_int))


# примеры преобразования
# num_bool = True
# print(int(num_bool))
# num_bool = str(num_bool)
# print(num_bool)
# print(type(num_bool))

# str_num = True
# str_num = str(str_num)
# print(str_num)
# print(type(str_num))


# ввод данных
# input() - возвращает строку
# num_inp = int(input("введите int__"))
# num_inp = int(num_inp)
# print("num_inp = ", num_inp * 4)

# print(float("y"))





# dz
# задача 1
# Дана диагональ телевизора в дюймах. Написать программу, определяющую эту же диагональ в сантиметрах 
# (1 дюйм = 2.54 сантиметров).
inch = 3
print(inch , "дюйм =" , inch * 2.54 , "сантиметров")

# задача 2
# Емкость аккумулятора смартфона составляет N мАч. 
# Написать программу, определяющую минимальную 
# емкость переносного зарядного устройства (powerbank), 
# если необходимо 3 полных заряда смартфона.

# задача 3
# За один день хомячок съедает K грамм корма. 
# Написать программу, определяющую закупку корма в килограммах на 30 дней.

# задача 4 
# Пользователь вводит с клавиатуры денежную 
# сумму в рублях и копейках (рубли и копейки вводятся 
# в разные переменные). Сумма может быть введена как 
# правильно (например 19 руб. 90 коп), так и неправильно 
# (например 22 руб. 978 коп). Написать программу, которая, 
# используя только линейный алгоритм, осуществит корректировку введенной денежной суммы в правильную форму.
# Например, если пользователь ввел 11 руб. 150 коп, 
# программа должна вывести на экран сумму 12 руб. 50 копю

# задача 5
# Пользователь вводит с клавиатуры время 
# в секундах, прошедшее с начала дня. Вывести на экран 
# текущее время в часах, минутах и секундах. Посчитать, 
# сколько часов, минут и секунд осталось до полуночию

# задача 6
# Пользователь вводит с клавиатуры три числа. 
# Посчитать их сумму, произведение и среднее арифметическое.






