
# умножение строки
# str_int = "5"
# print(str_int * 3)
# print(type(str_int))

# print("---------------")

# str_int_2 = 5
# print(str_int_2 * 3)
# print(type(str_int_2))



# преобразовываем из типа float в тип int
# num_1 = 5.8
# print(num_1)
# print(type(num_1))
# print("---------------")
# num_1 = int(num_1)
# print(num_1)
# print(type(num_1))



# ввод данных
# num_3 = input()
# print("ok")
# print("num_3 = ", num_3)



# ввод данных и преобразование в число
num_4 = input("ввод ==")
print("ok")
print("num_3 = ", num_4)
print(type(num_4))
num_4 = int(num_4)
print(type(num_4))





# дз
# задача 1
# Напишите программу, которая вычисляем объём шара.

# задача 2
# Написать программу вычисления расстояния 
# между двумя точками.

# Задание 3
# Написать программу вычисления объема параллелепипеда. Ниже приведен рекомендуемый вид экрана 
# во время выполнения программы.
# Вычисление объема параллелепипеда.
# Введите исходные данные:
# Длина (см) -> 9;
# Ширина (см) -> 7.5;
# Высота (см) -> 5;
# Объем: 337.50 куб. см.

# Задание 4
# Зарплата менеджера — 100$ + 5% от продаж. 
# Пользователь вводит с клавиатуры общую сумму сделок менеджера за месяц. 
# Посчитать итоговую зарплату менеджера.

